In [2]:
import pandas as pd
import numpy as np

In [ ]:
#ACTORES (Nombre concatenado)

In [46]:
actores_bis=pd.read_csv("/Users/jeffworker/Documents/GitHub/Bootcamp/Ejercicios/w3-database-project/data/csv_clean_data/actors.csv",sep=',', encoding='latin-1')

In [61]:

df = pd.DataFrame(actores_bis,columns=['first_name','last_name','actor_id']) 
df["Full Name"] = df["first_name"] + df["last_name"]
print(df)

    first_name     last_name  actor_id           Full Name
0     PENELOPE       GUINESS         1     PENELOPEGUINESS
1         NICK      WAHLBERG         2        NICKWAHLBERG
2           ED         CHASE         3             EDCHASE
3     JENNIFER         DAVIS         4       JENNIFERDAVIS
4       JOHNNY  LOLLOBRIGIDA         5  JOHNNYLOLLOBRIGIDA
..         ...           ...       ...                 ...
195       BELA        WALKEN       196          BELAWALKEN
196      REESE          WEST       197           REESEWEST
197       MARY        KEITEL       198          MARYKEITEL
198      JULIA       FAWCETT       199        JULIAFAWCETT
199      THORA        TEMPLE       200         THORATEMPLE

[200 rows x 4 columns]

In [62]:
df.drop(['first_name'], axis=1, inplace= True)

In [63]:
df.drop(['last_name'], axis=1, inplace= True)

In [64]:
df.head()

   actor_id           Full Name
0         1     PENELOPEGUINESS
1         2        NICKWAHLBERG
2         3             EDCHASE
3         4       JENNIFERDAVIS
4         5  JOHNNYLOLLOBRIGIDA

In [ ]:
#EXPORTAR NUEVO ACTOR

In [65]:
df.to_csv('new_actors.csv', index = False)

In [50]:
#OLD_HDD (Nombre concatenado) + UNIR ACTOR ID

In [51]:
old_bis=pd.read_csv("/Users/jeffworker/Documents/GitHub/Bootcamp/Ejercicios/w3-database-project/data/csv_clean_data/old_data.csv",sep=',', encoding='latin-1')

In [52]:
old_bis.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [57]:
old_correct = pd.DataFrame(old_bis,columns=['first_name','last_name','title','release_year','category_id','Full Name']) 
old_correct["Full Name"] = old_correct["first_name"] + old_correct["last_name"]
print(old_correct)

    first_name last_name                  title  release_year  category_id  \
0     PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2     PENELOPE   GUINESS            ANGELS LIFE          2006           13
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4     PENELOPE   GUINESS          CHEAPER CLYDE          2006           14
..         ...       ...                    ...           ...          ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY          2006            3
996     GOLDIE     BRODY        DAISY MENAGERIE          2006           14
997     GOLDIE     BRODY        DESERT POSEIDON          2006           11
998     GOLDIE     BRODY         EVERYONE CRAFT          2006            9
999     GOLDIE     BRODY         EXORCIST STING          2006           15

           Full Name
0    PENELOPEGUINESS
1    PENELOPEGUINESS
2    PENELOPEGUINESS
3    PENELOPEGUINESS
4    PENELOPEGUINESS
..               ...
995      GOLDIEBRODY
996      GOLDIEBRODY
997      GOLDIEBRODY
998      GOLDIEBRODY
999      GOLDIEBRODY

[1000 rows x 6 columns]

In [58]:
old_correct.drop(['first_name'], axis=1, inplace= True)

In [59]:
old_correct.drop(['last_name'], axis=1, inplace= True)

In [60]:
old_correct.head()

                   title  release_year  category_id        Full Name
0       ACADEMY DINOSAUR          2006            6  PENELOPEGUINESS
1   ANACONDA CONFESSIONS          2006            2  PENELOPEGUINESS
2            ANGELS LIFE          2006           13  PENELOPEGUINESS
3  BULWORTH COMMANDMENTS          2006           10  PENELOPEGUINESS
4          CHEAPER CLYDE          2006           14  PENELOPEGUINESS

In [ ]:
#EXPORTAR NUEVO OLD_HDD

In [66]:
old_correct.to_csv('new_old_data.csv', index = False)